InformationRegisters/АЭ_ЗначенияВидовПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АЭ_ЗначенияВидовПроцентныхСтавок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АЭ_ВидыСтавок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АЭ_ЗначенияВидовПроцентныхСтавок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Процедура заполняет значения ставки рефинансирования.
// Центрального Банка Российской Федерации 
//
Процедура ЗаполнитьЗначенияСтавкиРефинансированияЦБ() Экспорт
	
	КлассификаторXML = РегистрыСведений.АЭ_ЗначенияВидовПроцентныхСтавок.ПолучитьМакет("СтавкаРефинансированияЦБ").ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.АЭ_ЗначенияВидовПроцентныхСтавок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидСтавки.Установить(Справочники.АЭ_ВидыСтавок.КлючеваяСтавкаЦБ);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.Период 	= Дата(СтрокаКлассификатора.Date);
		СтрокаНабора.ВидСтавки 	= Справочники.АЭ_ВидыСтавок.КлючеваяСтавкаЦБ;
		СтрокаНабора.Процент	= Число(СтрокаКлассификатора.Rate);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
